###################################################################

# Created by write_sdc on Tue Dec 10 02:35:10 2024

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_max_fanout 4 [current_design]
set_max_area 0
set_driving_cell -lib_cell INVX1TS [get_ports i_wrclk]
set_driving_cell -lib_cell INVX1TS [get_ports i_wrstn]
set_driving_cell -lib_cell INVX1TS [get_ports i_wren]
set_driving_cell -lib_cell INVX1TS [get_ports {i_wdata[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {i_wdata[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {i_wdata[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {i_wdata[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {i_wdata[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {i_wdata[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {i_wdata[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {i_wdata[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {i_wdata[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {i_wdata[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {i_wdata[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {i_wdata[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {i_wdata[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {i_wdata[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {i_wdata[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {i_wdata[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports i_rdclk]
set_driving_cell -lib_cell INVX1TS [get_ports i_rdrstn]
set_driving_cell -lib_cell INVX1TS [get_ports i_rden]
set_load -pin_load 0.005 [get_ports {o_rdata[15]}]
set_load -pin_load 0.005 [get_ports {o_rdata[14]}]
set_load -pin_load 0.005 [get_ports {o_rdata[13]}]
set_load -pin_load 0.005 [get_ports {o_rdata[12]}]
set_load -pin_load 0.005 [get_ports {o_rdata[11]}]
set_load -pin_load 0.005 [get_ports {o_rdata[10]}]
set_load -pin_load 0.005 [get_ports {o_rdata[9]}]
set_load -pin_load 0.005 [get_ports {o_rdata[8]}]
set_load -pin_load 0.005 [get_ports {o_rdata[7]}]
set_load -pin_load 0.005 [get_ports {o_rdata[6]}]
set_load -pin_load 0.005 [get_ports {o_rdata[5]}]
set_load -pin_load 0.005 [get_ports {o_rdata[4]}]
set_load -pin_load 0.005 [get_ports {o_rdata[3]}]
set_load -pin_load 0.005 [get_ports {o_rdata[2]}]
set_load -pin_load 0.005 [get_ports {o_rdata[1]}]
set_load -pin_load 0.005 [get_ports {o_rdata[0]}]
set_load -pin_load 0.005 [get_ports o_full]
set_load -pin_load 0.005 [get_ports o_empty]
set_max_capacitance 0.005 [get_ports i_wrclk]
set_max_capacitance 0.005 [get_ports i_wrstn]
set_max_capacitance 0.005 [get_ports i_wren]
set_max_capacitance 0.005 [get_ports {i_wdata[15]}]
set_max_capacitance 0.005 [get_ports {i_wdata[14]}]
set_max_capacitance 0.005 [get_ports {i_wdata[13]}]
set_max_capacitance 0.005 [get_ports {i_wdata[12]}]
set_max_capacitance 0.005 [get_ports {i_wdata[11]}]
set_max_capacitance 0.005 [get_ports {i_wdata[10]}]
set_max_capacitance 0.005 [get_ports {i_wdata[9]}]
set_max_capacitance 0.005 [get_ports {i_wdata[8]}]
set_max_capacitance 0.005 [get_ports {i_wdata[7]}]
set_max_capacitance 0.005 [get_ports {i_wdata[6]}]
set_max_capacitance 0.005 [get_ports {i_wdata[5]}]
set_max_capacitance 0.005 [get_ports {i_wdata[4]}]
set_max_capacitance 0.005 [get_ports {i_wdata[3]}]
set_max_capacitance 0.005 [get_ports {i_wdata[2]}]
set_max_capacitance 0.005 [get_ports {i_wdata[1]}]
set_max_capacitance 0.005 [get_ports {i_wdata[0]}]
set_max_capacitance 0.005 [get_ports i_rdclk]
set_max_capacitance 0.005 [get_ports i_rdrstn]
set_max_capacitance 0.005 [get_ports i_rden]
set_max_fanout 4 [get_ports i_wrclk]
set_max_fanout 4 [get_ports i_wrstn]
set_max_fanout 4 [get_ports i_wren]
set_max_fanout 4 [get_ports {i_wdata[15]}]
set_max_fanout 4 [get_ports {i_wdata[14]}]
set_max_fanout 4 [get_ports {i_wdata[13]}]
set_max_fanout 4 [get_ports {i_wdata[12]}]
set_max_fanout 4 [get_ports {i_wdata[11]}]
set_max_fanout 4 [get_ports {i_wdata[10]}]
set_max_fanout 4 [get_ports {i_wdata[9]}]
set_max_fanout 4 [get_ports {i_wdata[8]}]
set_max_fanout 4 [get_ports {i_wdata[7]}]
set_max_fanout 4 [get_ports {i_wdata[6]}]
set_max_fanout 4 [get_ports {i_wdata[5]}]
set_max_fanout 4 [get_ports {i_wdata[4]}]
set_max_fanout 4 [get_ports {i_wdata[3]}]
set_max_fanout 4 [get_ports {i_wdata[2]}]
set_max_fanout 4 [get_ports {i_wdata[1]}]
set_max_fanout 4 [get_ports {i_wdata[0]}]
set_max_fanout 4 [get_ports i_rdclk]
set_max_fanout 4 [get_ports i_rdrstn]
set_max_fanout 4 [get_ports i_rden]
set_ideal_network [get_ports i_wrclk]
set_ideal_network [get_ports i_rdclk]
create_clock [get_ports i_wrclk]  -period 100000  -waveform {0 50000}
create_clock [get_ports i_rdclk]  -period 1000  -waveform {0 500}
set_clock_uncertainty 0  [get_clocks i_rdclk]
set_clock_transition -max -rise 0.01 [get_clocks i_rdclk]
set_clock_transition -max -fall 0.01 [get_clocks i_rdclk]
set_clock_transition -min -rise 0.01 [get_clocks i_rdclk]
set_clock_transition -min -fall 0.01 [get_clocks i_rdclk]
set_input_delay -clock i_rdclk  0.05  [get_ports i_wrclk]
set_input_delay -clock i_rdclk  0.05  [get_ports i_rdclk]
set_input_delay -clock i_rdclk  0.05  [get_ports i_wrstn]
set_input_delay -clock i_rdclk  0.05  [get_ports i_wren]
set_input_delay -clock i_rdclk  0.05  [get_ports {i_wdata[15]}]
set_input_delay -clock i_rdclk  0.05  [get_ports {i_wdata[14]}]
set_input_delay -clock i_rdclk  0.05  [get_ports {i_wdata[13]}]
set_input_delay -clock i_rdclk  0.05  [get_ports {i_wdata[12]}]
set_input_delay -clock i_rdclk  0.05  [get_ports {i_wdata[11]}]
set_input_delay -clock i_rdclk  0.05  [get_ports {i_wdata[10]}]
set_input_delay -clock i_rdclk  0.05  [get_ports {i_wdata[9]}]
set_input_delay -clock i_rdclk  0.05  [get_ports {i_wdata[8]}]
set_input_delay -clock i_rdclk  0.05  [get_ports {i_wdata[7]}]
set_input_delay -clock i_rdclk  0.05  [get_ports {i_wdata[6]}]
set_input_delay -clock i_rdclk  0.05  [get_ports {i_wdata[5]}]
set_input_delay -clock i_rdclk  0.05  [get_ports {i_wdata[4]}]
set_input_delay -clock i_rdclk  0.05  [get_ports {i_wdata[3]}]
set_input_delay -clock i_rdclk  0.05  [get_ports {i_wdata[2]}]
set_input_delay -clock i_rdclk  0.05  [get_ports {i_wdata[1]}]
set_input_delay -clock i_rdclk  0.05  [get_ports {i_wdata[0]}]
set_input_delay -clock i_rdclk  0.05  [get_ports i_rdrstn]
set_input_delay -clock i_rdclk  0.05  [get_ports i_rden]
set_output_delay -clock i_rdclk  0.05  [get_ports {o_rdata[15]}]
set_output_delay -clock i_rdclk  0.05  [get_ports {o_rdata[14]}]
set_output_delay -clock i_rdclk  0.05  [get_ports {o_rdata[13]}]
set_output_delay -clock i_rdclk  0.05  [get_ports {o_rdata[12]}]
set_output_delay -clock i_rdclk  0.05  [get_ports {o_rdata[11]}]
set_output_delay -clock i_rdclk  0.05  [get_ports {o_rdata[10]}]
set_output_delay -clock i_rdclk  0.05  [get_ports {o_rdata[9]}]
set_output_delay -clock i_rdclk  0.05  [get_ports {o_rdata[8]}]
set_output_delay -clock i_rdclk  0.05  [get_ports {o_rdata[7]}]
set_output_delay -clock i_rdclk  0.05  [get_ports {o_rdata[6]}]
set_output_delay -clock i_rdclk  0.05  [get_ports {o_rdata[5]}]
set_output_delay -clock i_rdclk  0.05  [get_ports {o_rdata[4]}]
set_output_delay -clock i_rdclk  0.05  [get_ports {o_rdata[3]}]
set_output_delay -clock i_rdclk  0.05  [get_ports {o_rdata[2]}]
set_output_delay -clock i_rdclk  0.05  [get_ports {o_rdata[1]}]
set_output_delay -clock i_rdclk  0.05  [get_ports {o_rdata[0]}]
set_output_delay -clock i_rdclk  0.05  [get_ports o_full]
set_output_delay -clock i_rdclk  0.05  [get_ports o_empty]
